Repository: JLyne/vrt-cogs
Catalog: autodocs/locales/*.po
Languages: ru_ru

source: Document your cogs with ease! Easily create documentation for any cog in Markdown format.
ru_ru: Создавать документации — легко! Без проблем создавайте документации для любых коков в формате Markdown.

source: {} Cog Version: {} Author: {}
ru_ru: {} Версия расширения: {} Автор: {}

source: No data to delete
ru_ru: Нет данных для удаления

source: name
ru_ru: название

source: text
ru_ru: текст

source: Help
ru_ru: Справка

source: {} cog description
ru_ru: {} Описание расширения

source: Create docs for a cog
ru_ru: Создать документацию для расширения

source: The name of the cog you want to make docs for (Case Sensitive)
ru_ru: Название расширения, для которого Вы хотите создать документацию **[!]** Учитывает регистр

source: Replace all occurrences of [p] with the bots prefix
ru_ru: Заменить все сокращения [p] текущим префиксом приложения

source: Replace all occurrences of [botname] with the bots name
ru_ru: Заменить все сокращения [botname] текущим наименованием приложения

source: Include extra info like converters and their docstrings
ru_ru: Включить дополнительную информацию, например: конвертеры и их строки документации

source: Include hidden commands
ru_ru: Отображать скрытые команды

source: Hide commands above specified privilege level (user, mod, admin, guildowner, botowner)
ru_ru: Скрыть команды выше указанного уровня привилегий (пользователь, мод, администратор, владелец сервера, владелец приложения)

source: Include a csv with each command isolated per row
ru_ru: Включите csv-файл, в котором каждая команда будет выделена в отдельную строку

source: Hide commands below specified privilege level (user, mod, admin, guildowner, botowner)
ru_ru: Скрыть команды выше указанного уровня привилегий (пользователь, мод, администратор, владелец сервера, владелец приложения)

source: Create a Markdown docs page for a cog and send to discord **Arguments** `cog_name: `(str) The name of the cog you want to make docs for (Case Sensitive) `replace_prefix: `(bool) If True, replaces the `prefix` placeholder with the bots prefix `replace_botname: `(bool) If True, replaces the `botname` placeholder with the bots name `extended_info: `(bool) If True, include extra info like converters and their docstrings `include_hidden: `(bool) If True, includes hidden commands `privilege_level: `(str) Hide commands above specified privilege level - (user, mod, admin, guildowner, botowner) `csv_export: `(bool) Include a csv with each command isolated per row for use as embeddings **Note** If `all` is specified for cog_name, all currently loaded non-core cogs will have docs generated for them and sent in a zip file
ru_ru: Создать документационную страницу Markdown для расширения и отправить в Discord **Аргументы** `cog_name: `(str) Название расширения, для которого Вы хотите создать документ. **[!]** Учитывает регистр `replace_prefix: `(bool) Если `True`, заменяет приставку `[p]` на действительный префикс `replace_botname: `(bool) Если `True`, заменяет приставку `[botname]` на пользовательское имя бота `extended_info: `(bool) Если `True`, включает допольнительную информацию, типа конвертеров и их `docstrings` `include_hidden: `(bool) Если `True`, отобразит скрытые команды `privilege_level: `(str) Скрывает команды, выше указанного уровня привилегий - (user, mod, admin, guildowner, botowner) `csv_export: `(bool) Включит `csv` для каждой команды, изолированная отдельной строкой для эмбеддинга **Примечание** Если `all` обозначено для `cog_name`, все загруженные расширения, кроме центральных (core) получат документацию, впоследствии заархивируя их

source: Here are the docs for all of your currently loaded cogs!
ru_ru: Здесь вся документация для загруженных расширений

source: I could not find that cog, maybe it is not loaded?
ru_ru: Не могу найти данное расширение. Возможно, оно не загружено.

source: Here are your docs for {}!
ru_ru: Документация для {}.

source: Registers a command with Assistant enabling it to access to command docs
ru_ru: Регистрирует команду с ассистентом, позволяющую получить доступ к командному документу

source: A single word, if not using slash and multiple words are necessary use a quote e.g "Hello world".
ru_ru: Одно слово. Если не используете слэш, необходимо проставить кавычки. Пример: "Привет, мир".

source: A number without decimal places.
ru_ru: Число без знаков после запятой.

source: A number with or without decimal places.
ru_ru: Число с **или** без знаков после запятой.

source: Can be 1, 0, true, false, t, f
ru_ru: Возможные варианты: `1`, `0`, `true`, `t`, `false`, `f`.

source: Formats documentation for a single command
ru_ru: Форматирует документацию для одной команды

source: per
ru_ru: каждую

source: seconds
ru_ru: секунды

source: second
ru_ru: секунду

source: Slash
ru_ru: Слэш

source: Command
ru_ru: Команда

source: Hybrid
ru_ru: Гибрид

source: Usage
ru_ru: Использование

source: Checks
ru_ru: Проверяет

source: Required
ru_ru: Необходим

source: Optional
ru_ru: Опционально

source: Server Only
ru_ru: Только сервер

source: Restricted to
ru_ru: Ограничено

source: Aliases
ru_ru: Псевдонимы

source: Cooldown
ru_ru: Интервал

source: Could not get docstring or class for {} converter
ru_ru: Не удалось получить строку документации или класс для {} конвертера

source: Could not get docstring for {} converter
ru_ru: Не удалось получить строку документации для {} конвертера

source: Could not get class for {} converter
ru_ru: Не удалось получить класс для {} конвертера

source: Autocomplete
ru_ru: Автоматическое завершение

source: Default
ru_ru: По умолчанию

source: Choices
ru_ru: Возможные значения

source: Could not find {} for the {} argument of the {} command
ru_ru: Не удалось найти {} для аргумента {} команды {}

source: Extended Arg Info
ru_ru: Расширенная информация об аргументах
